{
  "website": {
    "name": "bernardovc"
  },
  "personalInfo": {
    "name": "Bernardo Villalba Cahue",
    "title": "Software Engineer | Data-Intensive Systems & FinTech",
    "location": "Minneapolis, MN",
    "email": "bernardo@bernardovc.dev",
    "linkedinUrl": "https://www.linkedin.com/in/bernardo-villalba-cahue",
    "githubUrl": "https://github.com/capatazche"
  },
  "resume": {
    "summary": "Software Engineer specializing in data-intensive systems, full-stack applications, complex data pipelines, and modern cloud infrastructure.",
    "experience": [
      {
        "title": "Co-Founder & Lead Software Engineer",
        "organization": "Narranomics",
        "location": "Minneapolis, Minnesota, United States",
        "dateRange": "May 2023 - Present",
        "details": [
          "Led the strategy and development of an AI-driven, sentiment-based financial futures trading strategy and presented it to prospective investors and key stakeholders.",
          "Used Python, Docker, and Kubernetes, to develop and deploy a recurrent automated job to scrape and ingest communications from the Federal Reserve.",
          "Owned the entirety of the frontend, including a specialized data labeling, data analysis, and system health applications as well as the Narranomics public website. These were developed with React and NextJS.",
          "Owned the backend and DBs supporting the data labeling and data analysis frontends. It is written in Kotlin and connected to a PostreSQL DB.",
          "Leveraged our auto-scaling Kubernetes cluster, Docker, and Argo-Workflows to design and implement a parallelized simulation framework in Python to backtest hundreds of thousands of trading strategy parameters, reducing the R&D cycle duration by over 90%."
        ]
      },
      {
        "title": "Software Engineer, Science and Modeling",
        "organization": "CIBO Technologies",
        "location": "Minneapolis, Minnesota, United States",
        "dateRange": "June 2021 - May 2023",
        "details": [
          "Maintained and scaled a complex data processing pipeline to support the science and modeling team's research and development efforts.",
          "Developed Python scripts to automate data tabulation and analysis, improving the efficiency of data preparation for modeling.",
          "Built and executed custom simulations using a variety of data inputs to deliver key modeling insights for external clients."
        ]
      },
      {
        "title": "Full Stack Software Developer",
        "organization": "CarVal Investors",
        "location": "Minneapolis, Minnesota, United States",
        "dateRange": "June 2020 - May 2021",
        "details": [
          "Played a key role in a small agile team that migrated software development from a third-party vendor to an in-house team.",
          "Contributed across the full product lifecycle, including product ownership, UX design, and full-stack software engineering.",
          "Focused on the development, maintenance, and strategic consolidation of internal business and investment analysis applications."
        ]
      },
      {
        "title": "Software Engineer",
        "organization": "Virgin Pulse",
        "location": "Minneapolis, Minnesota, United States",
        "dateRange": "January 2019 - June 2020",
        "details": [
          "Developed and maintained features for a complex rules engine that executed gamified rewards to nudge members towards healthier behaviors.",
          "Served as a key contributor on the team that built the company's live services coaching platform from the ground up.",
          "Engineered solutions that incorporated third-party software, including Salesforce Health Cloud, into the core platform."
        ]
      },
      {
        "title": "Technology Analyst (Software Engineer)",
        "organization": "Deutsche Bank",
        "location": "Cary, North Carolina, United States",
        "dateRange": "July 2016 - September 2017",
        "details": [
          "Implemented new features and documented code for DB Entitlements, the bank's largest internal authorization application.",
          "Developed a new UI for the Distressed Products Group to visualize and edit complex financial instruments.",
          "Automated the generation of three weekly reports for the trading team, saving approximately 9 person-hours per month."
        ]
      }
    ],
    "education": [
      {
        "title": "Master's degree, Cognitive and Decision Making Sciences",
        "organization": "University College London (UCL)",
        "location": "London, England, United Kingdom",
        "dateRange": "2017 - 2018",
        "details": [
          "CONACYT - FUNED scholarship recipient."
        ]
      },
      {
        "title": "Bachelor's degree, Mathematics with a focus on Computer Applications",
        "organization": "University of Minnesota - Twin Cities",
        "location": "Minneapolis, Minnesota, Unites States",
        "dateRange": "2012 - 2016",
        "details": [
          "Deans List of College of Science and Engineering (Fall 2012, Spring 2013, Spring 2014).",
          "Global Excellence Scholarship recipient.",
          "School of Mathematics Maximillian Lando Scholarship recipient.",
          "J.A. Wedum Foundation Scholarship recipient."
        ]
      }
    ],
    "skills": {
      "languages": ["Python", "Kotlin", "Java", "TypeScript/JavaScript", "Scala", "SQL", "Matlab"],
      "cloudDevOps": ["AWS", "Docker", "Kubernetes", "Terraform", "Jenkins", "Argo Workflows", "Ansible", "TeamCity", "uDeploy", "SBT"],
      "dataScience": ["Pandas", "NumPy", "DuckDB", "Scikit-learn", "NLP"],
      "backend": ["Spring", "Flask", "PostgreSQL", "Cassandra", "Apache Storm", "Jinja2"],
      "frontend": ["React", "Angular/AngularJS", "Bootstrap", "Ui-Grid"],
      "developerTools": ["Git", "Github", "Bitbucket", "SVN", "Jira", "Pytest", "Cypress", "Salesforce", "Intellij", "Linux"]
    }
  }
}
